export default function transleteToCyr(str) {
	let arrru = ['Я', 'я', 'Ю', 'ю', 'Ч', 'ч', 'Ш', 'ш', 'Щ', 'щ', 'Ж', 'ж', 'о', 'х', 'Е', 'ый', 'Х', 'ий', 'ей', 'льск', 'Казань', 'Обь' ,'А', 'а', 'Б', 'б', 'В', 'в', 'Г', 'г', 'Д', 'д', 'Е', 'е', 'Ё', 'ё', 'З', 'з', 'И', 'и', 'Й', 'й', 'К', 'к', 'Л', 'л', 'М', 'м', 'Н', 'н', 'О', 'о', 'П', 'п', 'Р', 'р', 'С', 'с', 'Т', 'т', 'У', 'у', 'Ф', 'ф', 'Х', 'х', 'Ц', 'ц', 'ы', 'ь', 'ъ', 'Э', 'э', 'ь', 'в']
	let arren = ['Ya', 'ya', 'Yu', 'yu', 'Ch', 'ch', 'Sh', 'sh', 'Sh', 'sh', 'Zh', 'zh', 'oy', 'kh', 'Ye', 'yy', 'Kh', 'iy', 'ey', 'lsk', 'Kazan', 'Ob', 'A', 'a', 'B', 'b', 'V', 'v', 'G', 'g', 'D', 'd', 'E', 'e', 'E', 'e', 'Z', 'z', 'I', 'i', 'J', 'j', 'K', 'k', 'L', 'l', 'M', 'm', 'N', 'n', 'O', 'o', 'P', 'p', 'R', 'r', 'S', 's', 'T', 't', 'U', 'u', 'F', 'f', 'H', 'h', 'C', 'c', 'y', "'", '\'', 'E', 'e', '’', 'w']
	for (let i = 0; i < arren.length; i++) {
		let reg = new RegExp(arren[i], 'g')

		str = str.replace(reg, arrru[i])
	}
	return str
}